cache-practice/k6-hotkey-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/test-lazy-cache-hotkey.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m01.0s/2m00.0s

running (0m02.0s), 004/100 VUs, 34 complete and 0 interrupted iterations
default   [   2% ] 004/100 VUs  0m02.0s/2m00.0s

running (0m03.0s), 005/100 VUs, 69 complete and 0 interrupted iterations
default   [   2% ] 005/100 VUs  0m03.0s/2m00.0s

running (0m04.0s), 007/100 VUs, 119 complete and 0 interrupted iterations
default   [   3% ] 007/100 VUs  0m04.0s/2m00.0s

running (0m05.0s), 009/100 VUs, 188 complete and 0 interrupted iterations
default   [   4% ] 009/100 VUs  0m05.0s/2m00.0s

running (0m06.0s), 010/100 VUs, 273 complete and 0 interrupted iterations
default   [   5% ] 010/100 VUs  0m06.0s/2m00.0s

running (0m07.0s), 012/100 VUs, 362 complete and 0 interrupted iterations
default   [   6% ] 012/100 VUs  0m07.0s/2m00.0s

running (0m08.0s), 014/100 VUs, 467 complete and 0 interrupted iterations
default   [   7% ] 014/100 VUs  0m08.0s/2m00.0s

running (0m09.0s), 015/100 VUs, 596 complete and 0 interrupted iterations
default   [   7% ] 015/100 VUs  0m09.0s/2m00.0s

running (0m10.0s), 017/100 VUs, 739 complete and 0 interrupted iterations
default   [   8% ] 017/100 VUs  0m10.0s/2m00.0s

running (0m11.0s), 018/100 VUs, 899 complete and 0 interrupted iterations
default   [   9% ] 018/100 VUs  0m11.0s/2m00.0s

running (0m12.0s), 020/100 VUs, 1072 complete and 0 interrupted iterations
default   [  10% ] 020/100 VUs  0m12.0s/2m00.0s

running (0m13.0s), 022/100 VUs, 1259 complete and 0 interrupted iterations
default   [  11% ] 022/100 VUs  0m13.0s/2m00.0s

running (0m14.0s), 023/100 VUs, 1466 complete and 0 interrupted iterations
default   [  12% ] 023/100 VUs  0m14.0s/2m00.0s

running (0m15.0s), 025/100 VUs, 1693 complete and 0 interrupted iterations
default   [  12% ] 025/100 VUs  0m15.0s/2m00.0s

running (0m16.0s), 027/100 VUs, 1933 complete and 0 interrupted iterations
default   [  13% ] 027/100 VUs  0m16.0s/2m00.0s

running (0m17.0s), 028/100 VUs, 2161 complete and 0 interrupted iterations
default   [  14% ] 028/100 VUs  0m17.0s/2m00.0s

running (0m18.0s), 030/100 VUs, 2392 complete and 0 interrupted iterations
default   [  15% ] 030/100 VUs  0m18.0s/2m00.0s

running (0m19.0s), 032/100 VUs, 2626 complete and 0 interrupted iterations
default   [  16% ] 032/100 VUs  0m19.0s/2m00.0s

running (0m20.0s), 033/100 VUs, 2941 complete and 0 interrupted iterations
default   [  17% ] 033/100 VUs  0m20.0s/2m00.0s

running (0m21.0s), 035/100 VUs, 3224 complete and 0 interrupted iterations
default   [  17% ] 035/100 VUs  0m21.0s/2m00.0s

running (0m22.0s), 036/100 VUs, 3553 complete and 0 interrupted iterations
default   [  18% ] 036/100 VUs  0m22.0s/2m00.0s

running (0m23.0s), 038/100 VUs, 3910 complete and 0 interrupted iterations
default   [  19% ] 038/100 VUs  0m23.0s/2m00.0s

running (0m24.0s), 040/100 VUs, 4279 complete and 0 interrupted iterations
default   [  20% ] 040/100 VUs  0m24.0s/2m00.0s

running (0m25.0s), 041/100 VUs, 4665 complete and 0 interrupted iterations
default   [  21% ] 041/100 VUs  0m25.0s/2m00.0s

running (0m26.0s), 043/100 VUs, 5072 complete and 0 interrupted iterations
default   [  22% ] 043/100 VUs  0m26.0s/2m00.0s

running (0m27.0s), 045/100 VUs, 5479 complete and 0 interrupted iterations
default   [  22% ] 045/100 VUs  0m27.0s/2m00.0s

running (0m28.0s), 046/100 VUs, 5915 complete and 0 interrupted iterations
default   [  23% ] 046/100 VUs  0m28.0s/2m00.0s

running (0m29.0s), 048/100 VUs, 6367 complete and 0 interrupted iterations
default   [  24% ] 048/100 VUs  0m29.0s/2m00.0s

running (0m30.0s), 049/100 VUs, 6825 complete and 0 interrupted iterations
default   [  25% ] 049/100 VUs  0m30.0s/2m00.0s

running (0m31.0s), 050/100 VUs, 7310 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m31.0s/2m00.0s

running (0m32.0s), 051/100 VUs, 7780 complete and 0 interrupted iterations
default   [  27% ] 051/100 VUs  0m32.0s/2m00.0s

running (0m33.0s), 052/100 VUs, 8283 complete and 0 interrupted iterations
default   [  27% ] 052/100 VUs  0m33.0s/2m00.0s

running (0m34.0s), 053/100 VUs, 8782 complete and 0 interrupted iterations
default   [  28% ] 053/100 VUs  0m34.0s/2m00.0s

running (0m35.0s), 054/100 VUs, 9298 complete and 0 interrupted iterations
default   [  29% ] 054/100 VUs  0m35.0s/2m00.0s

running (0m36.0s), 054/100 VUs, 9819 complete and 0 interrupted iterations
default   [  30% ] 054/100 VUs  0m36.0s/2m00.0s

running (0m37.0s), 055/100 VUs, 10349 complete and 0 interrupted iterations
default   [  31% ] 055/100 VUs  0m37.0s/2m00.0s

running (0m38.0s), 056/100 VUs, 10884 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m38.0s/2m00.0s

running (0m39.0s), 057/100 VUs, 11433 complete and 0 interrupted iterations
default   [  32% ] 057/100 VUs  0m39.0s/2m00.0s

running (0m40.0s), 058/100 VUs, 11993 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m40.0s/2m00.0s

running (0m41.0s), 059/100 VUs, 12544 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m41.0s/2m00.0s

running (0m42.0s), 059/100 VUs, 13130 complete and 0 interrupted iterations
default   [  35% ] 059/100 VUs  0m42.0s/2m00.0s

running (0m43.0s), 060/100 VUs, 13706 complete and 0 interrupted iterations
default   [  36% ] 060/100 VUs  0m43.0s/2m00.0s

running (0m44.0s), 061/100 VUs, 14297 complete and 0 interrupted iterations
default   [  37% ] 061/100 VUs  0m44.0s/2m00.0s

running (0m45.0s), 062/100 VUs, 14893 complete and 0 interrupted iterations
default   [  37% ] 062/100 VUs  0m45.0s/2m00.0s

running (0m46.0s), 063/100 VUs, 15511 complete and 0 interrupted iterations
default   [  38% ] 063/100 VUs  0m46.0s/2m00.0s

running (0m47.0s), 064/100 VUs, 16125 complete and 0 interrupted iterations
default   [  39% ] 064/100 VUs  0m47.0s/2m00.0s

running (0m48.0s), 064/100 VUs, 16748 complete and 0 interrupted iterations
default   [  40% ] 064/100 VUs  0m48.0s/2m00.0s

running (0m49.0s), 065/100 VUs, 17381 complete and 0 interrupted iterations
default   [  41% ] 065/100 VUs  0m49.0s/2m00.0s
time="2025-11-23T20:20:33+09:00" level=warning msg="The test has generated metrics with 100098 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m50.0s), 066/100 VUs, 18028 complete and 0 interrupted iterations
default   [  42% ] 066/100 VUs  0m50.0s/2m00.0s

running (0m51.0s), 067/100 VUs, 18681 complete and 0 interrupted iterations
default   [  42% ] 067/100 VUs  0m51.0s/2m00.0s

running (0m52.0s), 068/100 VUs, 19316 complete and 0 interrupted iterations
default   [  43% ] 068/100 VUs  0m52.0s/2m00.0s

running (0m53.0s), 069/100 VUs, 19990 complete and 0 interrupted iterations
default   [  44% ] 069/100 VUs  0m53.0s/2m00.0s

running (0m54.0s), 069/100 VUs, 20674 complete and 0 interrupted iterations
default   [  45% ] 069/100 VUs  0m54.0s/2m00.0s

running (0m55.0s), 070/100 VUs, 21348 complete and 0 interrupted iterations
default   [  46% ] 070/100 VUs  0m55.0s/2m00.0s

running (0m56.0s), 071/100 VUs, 22048 complete and 0 interrupted iterations
default   [  47% ] 071/100 VUs  0m56.0s/2m00.0s

running (0m57.0s), 072/100 VUs, 22739 complete and 0 interrupted iterations
default   [  47% ] 072/100 VUs  0m57.0s/2m00.0s

running (0m58.0s), 073/100 VUs, 23450 complete and 0 interrupted iterations
default   [  48% ] 073/100 VUs  0m58.0s/2m00.0s

running (0m59.0s), 074/100 VUs, 24173 complete and 0 interrupted iterations
default   [  49% ] 074/100 VUs  0m59.0s/2m00.0s

running (1m00.0s), 074/100 VUs, 24895 complete and 0 interrupted iterations
default   [  50% ] 074/100 VUs  1m00.0s/2m00.0s

running (1m01.0s), 075/100 VUs, 25626 complete and 0 interrupted iterations
default   [  51% ] 075/100 VUs  1m01.0s/2m00.0s

running (1m02.0s), 076/100 VUs, 26363 complete and 0 interrupted iterations
default   [  52% ] 076/100 VUs  1m02.0s/2m00.0s

running (1m03.0s), 077/100 VUs, 27114 complete and 0 interrupted iterations
default   [  52% ] 077/100 VUs  1m03.0s/2m00.0s

running (1m04.0s), 078/100 VUs, 27875 complete and 0 interrupted iterations
default   [  53% ] 078/100 VUs  1m04.0s/2m00.0s

running (1m05.0s), 079/100 VUs, 28636 complete and 0 interrupted iterations
default   [  54% ] 079/100 VUs  1m05.0s/2m00.0s

running (1m06.0s), 079/100 VUs, 29410 complete and 0 interrupted iterations
default   [  55% ] 079/100 VUs  1m06.0s/2m00.0s

running (1m07.0s), 080/100 VUs, 30194 complete and 0 interrupted iterations
default   [  56% ] 080/100 VUs  1m07.0s/2m00.0s

running (1m08.0s), 081/100 VUs, 30982 complete and 0 interrupted iterations
default   [  57% ] 081/100 VUs  1m08.0s/2m00.0s

running (1m09.0s), 082/100 VUs, 31784 complete and 0 interrupted iterations
default   [  57% ] 082/100 VUs  1m09.0s/2m00.0s

running (1m10.0s), 083/100 VUs, 32591 complete and 0 interrupted iterations
default   [  58% ] 083/100 VUs  1m10.0s/2m00.0s

running (1m11.0s), 084/100 VUs, 33406 complete and 0 interrupted iterations
default   [  59% ] 084/100 VUs  1m11.0s/2m00.0s

running (1m12.0s), 084/100 VUs, 34214 complete and 0 interrupted iterations
default   [  60% ] 084/100 VUs  1m12.0s/2m00.0s

running (1m13.0s), 085/100 VUs, 35051 complete and 0 interrupted iterations
default   [  61% ] 085/100 VUs  1m13.0s/2m00.0s

running (1m14.0s), 086/100 VUs, 35898 complete and 0 interrupted iterations
default   [  62% ] 086/100 VUs  1m14.0s/2m00.0s

running (1m15.0s), 087/100 VUs, 36752 complete and 0 interrupted iterations
default   [  62% ] 087/100 VUs  1m15.0s/2m00.0s

running (1m16.0s), 088/100 VUs, 37605 complete and 0 interrupted iterations
default   [  63% ] 088/100 VUs  1m16.0s/2m00.0s

running (1m17.0s), 089/100 VUs, 38448 complete and 0 interrupted iterations
default   [  64% ] 089/100 VUs  1m17.0s/2m00.0s

running (1m18.0s), 089/100 VUs, 39327 complete and 0 interrupted iterations
default   [  65% ] 089/100 VUs  1m18.0s/2m00.0s

running (1m19.0s), 090/100 VUs, 40219 complete and 0 interrupted iterations
default   [  66% ] 090/100 VUs  1m19.0s/2m00.0s

running (1m20.0s), 091/100 VUs, 41116 complete and 0 interrupted iterations
default   [  67% ] 091/100 VUs  1m20.0s/2m00.0s

running (1m21.0s), 092/100 VUs, 41998 complete and 0 interrupted iterations
default   [  67% ] 092/100 VUs  1m21.0s/2m00.0s

running (1m22.0s), 093/100 VUs, 42881 complete and 0 interrupted iterations
default   [  68% ] 093/100 VUs  1m22.0s/2m00.0s

running (1m23.0s), 094/100 VUs, 43810 complete and 0 interrupted iterations
default   [  69% ] 094/100 VUs  1m23.0s/2m00.0s

running (1m24.0s), 094/100 VUs, 44736 complete and 0 interrupted iterations
default   [  70% ] 094/100 VUs  1m24.0s/2m00.0s

running (1m25.0s), 095/100 VUs, 45657 complete and 0 interrupted iterations
default   [  71% ] 095/100 VUs  1m25.0s/2m00.0s

running (1m26.0s), 096/100 VUs, 46596 complete and 0 interrupted iterations
default   [  72% ] 096/100 VUs  1m26.0s/2m00.0s

running (1m27.0s), 097/100 VUs, 47537 complete and 0 interrupted iterations
default   [  72% ] 097/100 VUs  1m27.0s/2m00.0s

running (1m28.0s), 098/100 VUs, 48498 complete and 0 interrupted iterations
default   [  73% ] 098/100 VUs  1m28.0s/2m00.0s

running (1m29.0s), 099/100 VUs, 49464 complete and 0 interrupted iterations
default   [  74% ] 099/100 VUs  1m29.0s/2m00.0s

running (1m30.0s), 099/100 VUs, 50433 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  1m30.0s/2m00.0s

running (1m31.0s), 097/100 VUs, 51406 complete and 0 interrupted iterations
default   [  76% ] 097/100 VUs  1m31.0s/2m00.0s

running (1m32.0s), 094/100 VUs, 52338 complete and 0 interrupted iterations
default   [  77% ] 094/100 VUs  1m32.0s/2m00.0s

running (1m33.0s), 091/100 VUs, 53257 complete and 0 interrupted iterations
default   [  77% ] 091/100 VUs  1m33.0s/2m00.0s

running (1m34.0s), 087/100 VUs, 54123 complete and 0 interrupted iterations
default   [  78% ] 087/100 VUs  1m34.0s/2m00.0s

running (1m35.0s), 084/100 VUs, 54942 complete and 0 interrupted iterations
default   [  79% ] 084/100 VUs  1m35.0s/2m00.0s

running (1m36.0s), 081/100 VUs, 55758 complete and 0 interrupted iterations
default   [  80% ] 081/100 VUs  1m36.0s/2m00.0s

running (1m37.0s), 077/100 VUs, 56543 complete and 0 interrupted iterations
default   [  81% ] 077/100 VUs  1m37.0s/2m00.0s

running (1m38.0s), 074/100 VUs, 57270 complete and 0 interrupted iterations
default   [  82% ] 074/100 VUs  1m38.0s/2m00.0s

running (1m39.0s), 071/100 VUs, 57986 complete and 0 interrupted iterations
default   [  82% ] 071/100 VUs  1m39.0s/2m00.0s

running (1m40.0s), 067/100 VUs, 58666 complete and 0 interrupted iterations
default   [  83% ] 067/100 VUs  1m40.0s/2m00.0s

running (1m41.0s), 064/100 VUs, 59291 complete and 0 interrupted iterations
default   [  84% ] 064/100 VUs  1m41.0s/2m00.0s

running (1m42.0s), 061/100 VUs, 59905 complete and 0 interrupted iterations
default   [  85% ] 061/100 VUs  1m42.0s/2m00.0s

running (1m43.0s), 057/100 VUs, 60491 complete and 0 interrupted iterations
default   [  86% ] 057/100 VUs  1m43.0s/2m00.0s

running (1m44.0s), 054/100 VUs, 61025 complete and 0 interrupted iterations
default   [  87% ] 054/100 VUs  1m44.0s/2m00.0s
time="2025-11-23T20:21:28+09:00" level=warning msg="The test has generated metrics with 200016 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (1m45.0s), 051/100 VUs, 61539 complete and 0 interrupted iterations
default   [  87% ] 051/100 VUs  1m45.0s/2m00.0s

running (1m46.0s), 047/100 VUs, 62026 complete and 0 interrupted iterations
default   [  88% ] 047/100 VUs  1m46.0s/2m00.0s

running (1m47.0s), 044/100 VUs, 62478 complete and 0 interrupted iterations
default   [  89% ] 044/100 VUs  1m47.0s/2m00.0s

running (1m48.0s), 041/100 VUs, 62894 complete and 0 interrupted iterations
default   [  90% ] 041/100 VUs  1m48.0s/2m00.0s

running (1m49.0s), 037/100 VUs, 63275 complete and 0 interrupted iterations
default   [  91% ] 037/100 VUs  1m49.0s/2m00.0s

running (1m50.0s), 034/100 VUs, 63621 complete and 0 interrupted iterations
default   [  92% ] 034/100 VUs  1m50.0s/2m00.0s

running (1m51.0s), 031/100 VUs, 63945 complete and 0 interrupted iterations
default   [  92% ] 031/100 VUs  1m51.0s/2m00.0s

running (1m52.0s), 028/100 VUs, 64226 complete and 0 interrupted iterations
default   [  93% ] 028/100 VUs  1m52.0s/2m00.0s

running (1m53.0s), 024/100 VUs, 64485 complete and 0 interrupted iterations
default   [  94% ] 024/100 VUs  1m53.0s/2m00.0s

running (1m54.0s), 021/100 VUs, 64700 complete and 0 interrupted iterations
default   [  95% ] 021/100 VUs  1m54.0s/2m00.0s

running (1m55.0s), 017/100 VUs, 64888 complete and 0 interrupted iterations
default   [  96% ] 017/100 VUs  1m55.0s/2m00.0s

running (1m56.0s), 014/100 VUs, 65042 complete and 0 interrupted iterations
default   [  97% ] 014/100 VUs  1m56.0s/2m00.0s

running (1m57.0s), 011/100 VUs, 65163 complete and 0 interrupted iterations
default   [  97% ] 011/100 VUs  1m57.0s/2m00.0s

running (1m58.0s), 008/100 VUs, 65251 complete and 0 interrupted iterations
default   [  98% ] 008/100 VUs  1m58.0s/2m00.0s

running (1m59.0s), 004/100 VUs, 65309 complete and 0 interrupted iterations
default   [  99% ] 004/100 VUs  1m59.0s/2m00.0s

running (2m00.0s), 001/100 VUs, 65333 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  2m00.0s/2m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 130668 1088.818756/s
    checks_succeeded...: 99.99% 130661 out of 130668
    checks_failed......: 0.00%  7 out of 130668

    ✗ status is 200
      ↳  99% — ✓ 65327 / ✗ 7
    ✓ response time < 200ms

    CUSTOM
    errors.........................: 0.01%  7 out of 65334

    HTTP
    http_req_duration..............: avg=2.83ms   min=103µs    med=577µs   max=142.97ms p(90)=5.61ms   p(95)=7.42ms  
      { expected_response:true }...: avg=2.83ms   min=103µs    med=577µs   max=142.97ms p(90)=5.61ms   p(95)=7.42ms  
    http_req_failed................: 0.01%  7 out of 65334
    http_reqs......................: 65334  544.409378/s

    EXECUTION
    iteration_duration.............: avg=103.15ms min=100.15ms med=101.4ms max=243.2ms  p(90)=106.01ms p(95)=108.16ms
    iterations.....................: 65334  544.409378/s
    vus............................: 1      min=1          max=99 
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 18 MB  153 kB/s
    data_sent......................: 5.9 MB 49 kB/s



running (2m00.0s), 000/100 VUs, 65334 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s